Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/svd/PIC32CK1025GC00100.svd
               <register>
                  <dim>16</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>PMUX[%s]</name>
                  <description>Peripheral Multiplexing</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PMUXE</name>
                        <description>Peripheral Multiplexing for Even-Numbered Pin</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>PMUXESelect</name>
                           <enumeratedValue>
                              <name>A</name>
                              <description>Peripheral function A selected</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>B</name>
                              <description>Peripheral function B selected</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>C</name>
                              <description>Peripheral function C selected</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>D</name>
                              <description>Peripheral function D selected</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>E</name>
                              <description>Peripheral function E selected</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>F</name>
                              <description>Peripheral function F selected</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>G</name>
                              <description>Peripheral function G selected</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>H</name>
                              <description>Peripheral function H selected</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I</name>
                              <description>Peripheral function I selected</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>J</name>
                              <description>Peripheral function J selected</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>K</name>
                              <description>Peripheral function K selected</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>L</name>
                              <description>Peripheral function L selected</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>M</name>
                              <description>Peripheral function M selected</description>
                              <value>0xC</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>P</name>
                              <description>Peripheral function P selected</description>
                              <value>0xF</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PMUXO</name>
                        <description>Peripheral Multiplexing for Odd-Numbered Pin</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>PMUXOSelect</name>
                           <enumeratedValue>
                              <name>A</name>
                              <description>Peripheral function A selected</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>B</name>
                              <description>Peripheral function B selected</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>C</name>
                              <description>Peripheral function C selected</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>D</name>
                              <description>Peripheral function D selected</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>E</name>
                              <description>Peripheral function E selected</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>F</name>
                              <description>Peripheral function F selected</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>G</name>
                              <description>Peripheral function G selected</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>H</name>
                              <description>Peripheral function H selected</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I</name>
                              <description>Peripheral function I selected</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>J</name>
                              <description>Peripheral function J selected</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>K</name>
                              <description>Peripheral function K selected</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>L</name>
                              <description>Peripheral function L selected</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>M</name>
                              <description>Peripheral function M selected</description>
                              <value>0xC</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>P</name>
                              <description>Peripheral function P selected</description>
                              <value>0xF</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>32</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>PINCFG[%s]</name>
                  <description>Pin Configuration</description>
                  <addressOffset>0x40</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PMUXEN</name>
                        <description>Peripheral Multiplexer Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INEN</name>
                        <description>Input Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PULLEN</name>
                        <description>Pull Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ODRAIN</name>
                        <description>Open Drain Output</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SLEWLIM</name>
                        <description>Output Driver Slew Rate Selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SLEWLIMSelect</name>
                           <enumeratedValue>
                              <name>FAST</name>
                              <description>Slew rate control disabled (fast rise/fall time operation)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW4</name>
                              <description>Slew rate control enabled (4x slower)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW8</name>
                              <description>Slew rate control enabled (8x slower)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW12</name>
                              <description>Slew rate control enabled (12x slower)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
